<a href="https://colab.research.google.com/github/khairihilmi01/LatihanProject1/blob/master/Time%20series%20/%20Time_series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import warnings
import itertools
import matplotlib.pyplot as plt
warnings.filterwarnings("ignore")
plt.style.use('fivethirtyeight')
import pandas as pd
import statsmodels.api as sm
import matplotlib
matplotlib.rcParams['axes.labelsize'] = 14
matplotlib.rcParams['xtick.labelsize'] = 12
matplotlib.rcParams['ytick.labelsize'] = 12
matplotlib.rcParams['text.color'] = 'k'

In [4]:
df = pd.read_excel(r"/content/Superstore.xls")
furniture = df.loc[df['Category'] == 'Furniture']

In [11]:
df.head(2)

   Row ID        Order ID Order Date  ... Quantity Discount    Profit
0       1  CA-2016-152156 2016-11-08  ...        2      0.0   41.9136
1       2  CA-2016-152156 2016-11-08  ...        3      0.0  219.5820

[2 rows x 21 columns]

In [9]:
furniture.shape

(2121, 21)

In [7]:
df.select_dtypes(include='datetime64[ns]')

     Order Date  Ship Date
0    2016-11-08 2016-11-11
1    2016-11-08 2016-11-11
2    2016-06-12 2016-06-16
3    2015-10-11 2015-10-18
4    2015-10-11 2015-10-18
...         ...        ...
9989 2014-01-21 2014-01-23
9990 2017-02-26 2017-03-03
9991 2017-02-26 2017-03-03
9992 2017-02-26 2017-03-03
9993 2017-05-04 2017-05-09

[9994 rows x 2 columns]

In [12]:
furniture['Order Date'].min(), furniture['Order Date'].max()

(Timestamp('2014-01-06 00:00:00'), Timestamp('2017-12-30 00:00:00'))

In [14]:
len(df.columns)

21

In [16]:
furniture = furniture[['Order Date','Sales']]

In [17]:
furniture.isnull().sum()

Order Date    0
Sales         0
dtype: int64

In [21]:
furniture.set_index('Order Date')

                Sales
Order Date
2016-11-08   261.9600
2016-11-08   731.9400
2015-10-11   957.5775
2014-06-09    48.8600
2014-06-09  1706.1840
...               ...
2015-03-19   383.4656
2016-12-05    13.4000
2015-09-06    85.9800
2014-01-21    25.2480
2017-02-26    91.9600

[2121 rows x 1 columns]